#Область ОписаниеПеременных

Перем Контекст;

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура Инициализация() Экспорт
	Контекст = Новый Структура;
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	НаборТестов.Добавить("ТестПозитивноеСложение");
	НаборТестов.Добавить("ТестНегативнаяПроверка");
КонецПроцедуры

Процедура ПередЗапускомТеста(ИмяТеста) Экспорт
	Контекст.Вставить("ИмяТеста", ИмяТеста);
КонецПроцедуры

Процедура ПослеЗапускаТеста(ИмяТеста) Экспорт
	Если Контекст.Свойство("ИмяТеста") Тогда
		Контекст.Удалить("ИмяТеста");
	КонецЕсли;
КонецПроцедуры

Процедура ТестПозитивноеСложение() Экспорт
	Результат = 2 + 2;
	Ожидаем.Что(Результат).Равно(4);
КонецПроцедуры

Процедура ТестНегативнаяПроверка() Экспорт
	Результат = 2 + 2;
	Ожидаем.Что(Результат).НеРавно(5);
КонецПроцедуры

#КонецОбласти

