#Область ОписаниеПеременных

Перем Контекст;

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура Инициализация() Экспорт
	Контекст = Новый Структура;
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	НаборТестов.Добавить("ТестДолженВыполнитьсяУспешно");
КонецПроцедуры

Процедура ПередЗапускомТеста(ИмяТеста) Экспорт
	Контекст.Вставить("ИмяТеста", ИмяТеста);
КонецПроцедуры

Процедура ПослеЗапускаТеста(ИмяТеста) Экспорт
	Если Контекст.Свойство("ИмяТеста") Тогда
		Контекст.Удалить("ИмяТеста");
	КонецЕсли;
КонецПроцедуры

Процедура ТестДолженВыполнитьсяУспешно() Экспорт
	Ожидаем.Что(Истина).ЭтоИстина();
КонецПроцедуры

#КонецОбласти

